sterentev/atdf-device-asm-include/inc/ATmega64HVE2.inc
; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	VADAC3		= 0xF6		; [MEMORY MAPPED] V-ADC Accumulated Conversion Result
.equ	VADAC2		= 0xF5		; [MEMORY MAPPED] V-ADC Accumulated Conversion Result
.equ	VADAC1		= 0xF4		; [MEMORY MAPPED] V-ADC Accumulated Conversion Result
.equ	VADAC0		= 0xF3		; [MEMORY MAPPED] V-ADC Accumulated Conversion Result
.equ	VADIC		= 0xF1		; [MEMORY MAPPED] V-ADC Instantaneous Conversion Result
.equ	CADAC3		= 0xF0		; [MEMORY MAPPED] C-ADC Accumulated Conversion Result
.equ	CADAC2		= 0xEF		; [MEMORY MAPPED] C-ADC Accumulated Conversion Result
.equ	CADAC1		= 0xEE		; [MEMORY MAPPED] C-ADC Accumulated Conversion Result
.equ	CADAC0		= 0xED		; [MEMORY MAPPED] C-ADC Accumulated Conversion Result
.equ	CADIC		= 0xEB		; [MEMORY MAPPED] C-ADC Instantaneous Conversion Result
.equ	CADRCL		= 0xE9		; [MEMORY MAPPED] CC-ADC Regulator Current Comparator Threshold Level
.equ	ADIMR		= 0xE8		; [MEMORY MAPPED] ADC Interrupt Mask Register
.equ	ADIFR		= 0xE7		; [MEMORY MAPPED] ADC Interrupt Flag Register
.equ	ADCRE		= 0xE6		; [MEMORY MAPPED] ADC Control Register E
.equ	ADCRD		= 0xE5		; [MEMORY MAPPED] ADC Control Register D
.equ	ADCRC		= 0xE4		; [MEMORY MAPPED] ADC Control Register B
.equ	ADCRB		= 0xE3		; [MEMORY MAPPED] ADC Control Register B
.equ	ADCRA		= 0xE2		; [MEMORY MAPPED] ADC Control Register A
.equ	ADSCSRB		= 0xE1		; [MEMORY MAPPED] ADC Synchronization Control and Status Register
.equ	ADSCSRA		= 0xE0		; [MEMORY MAPPED] ADC Synchronization Control and Status Register
.equ	PBOV		= 0xDC		; [MEMORY MAPPED] Port B Override
.equ	PLLCSR		= 0xD8		; [MEMORY MAPPED] PLL Control and Status Register
.equ	BGLR		= 0xD4		; [MEMORY MAPPED] Band Gap Lock Register
.equ	BGCRA		= 0xD3		; [MEMORY MAPPED] Band Gap Calibration Register A
.equ	BGCRB		= 0xD2		; [MEMORY MAPPED] Band Gap Calibration Register B
.equ	BGCSRA		= 0xD1		; [MEMORY MAPPED] Bandgap Control and Status Register A
.equ	LINDAT		= 0xCA		; [MEMORY MAPPED] LIN Data Register
.equ	LINSEL		= 0xC9		; [MEMORY MAPPED] LIN Data Buffer Selection Register
.equ	LINIDR		= 0xC8		; [MEMORY MAPPED] LIN Identifier Register
.equ	LINDLR		= 0xC7		; [MEMORY MAPPED] LIN Data Length Register
.equ	LINBRRH		= 0xC6		; [MEMORY MAPPED] LIN Baud Rate High Register
.equ	LINBRRL		= 0xC5		; [MEMORY MAPPED] LIN Baud Rate Low Register
.equ	LINBTR		= 0xC4		; [MEMORY MAPPED] LIN Bit Timing Register
.equ	LINERR		= 0xC3		; [MEMORY MAPPED] LIN Error Register
.equ	LINENIR		= 0xC2		; [MEMORY MAPPED] LIN Enable Interrupt Register
.equ	LINSIR		= 0xC1		; [MEMORY MAPPED] LIN Status and Interrupt Register
.equ	LINCR		= 0xC0		; [MEMORY MAPPED] LIN Control Register
.equ	OCR1B		= 0x89		; [MEMORY MAPPED] Output Compare Register B
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] Output Compare Register 1A
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer Counter 1  Bytes
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter 1 Control Register A
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	PCMSK1		= 0x6C		; [MEMORY MAPPED] Pin Change Enable Mask Register 1
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Enable Mask Register 0
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	SOSCCALB	= 0x67		; [MEMORY MAPPED] Oscillator Calibration Register B
.equ	SOSCCALA	= 0x66		; [MEMORY MAPPED] Slow Oscillator Calibration Register A
.equ	PRR0		= 0x64		; [MEMORY MAPPED] Power Reduction Register 0
.equ	WDTCLR		= 0x63		; [MEMORY MAPPED] Watchdog Timer Configuration Lock Register
.equ	WUTCSR		= 0x62		; [MEMORY MAPPED] Wake-up Timer Control and Status Register
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] Clock Prescale Register
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	SPMCSR		= 0x37		; Store Program Memory Control and Status Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	GPIOR2		= 0x2B		; General Purpose IO Register 2
.equ	GPIOR1		= 0x2A		; General Purpose IO Register 1
.equ	OCR0B		= 0x29		; Output Compare Register B
.equ	OCR0A		= 0x28		; Output Compare Register 0A
.equ	TCNT0		= 0x26		; Timer Counter 0  Bytes
.equ	TCCR0B		= 0x25		; Timer/Counter0 Control Register B
.equ	TCCR0A		= 0x24		; Timer/Counter 0 Control Register A
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; EEPROM Read/Write Access
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	TIFR1		= 0x16		; Timer/Counter Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter Interrupt Flag register
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Port A Data Direction Register
.equ	PINA		= 0x00		; Port A Input Pins


; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)

