sterentev/atdf-device-asm-include/inc/ATmega64HVE2.inc
; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      -  (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEProm Ready Interrupt Enable
.equ	EEMPE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEPE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable
; ::::  EEPM	:::: bitfield values
;			0x00		; Erase and Write in one operation
;			0x10		; Erase Only
;			0x20		; Write Only



; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR1B bits		------------------------
.equ	CS_MASK		= 0x07		;      - Clock Select1 bis (3 bits)
.equ	CS0		= 0		;          CS BIT0 position
; ::::  CS	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR1A bits		------------------------
.equ	TCW1		= 7		; 0x80 - Timer/Counter Width
.equ	ICEN1		= 6		; 0x40 - Input Capture Mode Enable
.equ	ICNC1		= 5		; 0x20 - Input Capture Noise Canceler
.equ	ICES1		= 4		; 0x10 - Input Capture Edge Select
.equ	ICS1		= 3		; 0x08 - Input Capture Select
.equ	WGM10		= 0		; 0x01 - Waveform Generation Mode

; ----------	Register TIMSK1 bits		------------------------
.equ	ICIE1		= 3		; 0x08 - Timer/Counter n Input Capture Interrupt Enable
.equ	OCIE1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Interrupt Enable
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

; ----------	Register TIFR1 bits		------------------------
.equ	ICF1		= 3		; 0x08 - Timer/Counter 1 Input Capture Flag
.equ	OCF1B		= 2		; 0x04 - Timer/Counter1 Output Compare Flag B
.equ	OCF1A		= 1		; 0x02 - Timer/Counter1 Output Compare Flag A
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset

; ----------	Register TCCR0B bits		------------------------
.equ	CS02		= 2		; 0x04 - Clock Select0 bit 2
.equ	CS01		= 1		; 0x02 - Clock Select0 bit 1
.equ	CS00		= 0		; 0x01 - Clock Select0 bit 0
; ::::  CS00	>>>> This is a part of CLK_SEL_3BIT_EXT enum (see complete values list below)

; ----------	Register TCCR0A bits		------------------------
.equ	TCW0		= 7		; 0x80 - Timer/Counter Width
.equ	ICEN0		= 6		; 0x40 - Input Capture Mode Enable
.equ	ICNC0		= 5		; 0x20 - Input Capture Noise Canceler
.equ	ICES0		= 4		; 0x10 - Input Capture Edge Select
.equ	ICS0		= 3		; 0x08 - Input Capture Select
.equ	WGM00		= 0		; 0x01 - Waveform Generation Mode

; ----------	Register TIMSK0 bits		------------------------
.equ	ICIE0		= 3		; 0x08 - Timer/Counter n Input Capture Interrupt Enable
.equ	OCIE0B		= 2		; 0x04 - Timer/Counter0 Output Compare B Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Timer/Counter0 Output Compare A Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Timer/Counter0 Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	ICF0		= 3		; 0x08 - Timer/Counter 0 Input Capture Flag
.equ	OCF0B		= 2		; 0x04 - Timer/Counter0 Output Compare Flag B
.equ	OCF0A		= 1		; 0x02 - Timer/Counter0 Output Compare Flag A
.equ	TOV0		= 0		; 0x01 - Timer/Counter0 Overflow Flag

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
;.equ	PSRSYNC		= 0		; 0x01 - Prescaler Reset



; ====	PORT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PBOV bits		------------------------
.equ	PBOVCE		= 7		; 0x80 - Port B Override Change Enable
.equ	PBOE3		= 3		; 0x08 - Port B Override Enable 3
.equ	PBOE0		= 0		; 0x01 - Port B Override Enable 0



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read-While-Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read-While-Write Section Read Enable
.equ	LBSET		= 3		; 0x08 - Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADSCSRA bits		------------------------
.equ	SBSY		= 2		; 0x04 - Synchronization Busy
.equ	SCMD_MASK	= 0x03		;      - Synchronization Command (2 bits)
.equ	SCMD0		= 0		;          SCMD BIT0 position
; ::::  SCMD	:::: bitfield values
;			0x00		; Reserved
;			0x01		; Reset and Synchronize
;			0x02		; Synchronize on next Instantaneous Conversion
;			0x03		; Synchronize on next Accumulated Conversion

; ----------	Register ADSCSRB bits		------------------------
.equ	VADICPS		= 6		; 0x40 - V-ADC Instantaneous Conversion Polarity Status
.equ	VADACRB		= 5		; 0x20 - VADAC Data Read Out Busy
.equ	VADICRB		= 4		; 0x10 - VADIC Data Read Out Busy
.equ	CADICPS		= 2		; 0x04 - C-ADC Instantaneous Conversion Polarity Status
.equ	CADACRB		= 1		; 0x02 - CADAC Data Read Out Busy
.equ	CADICRB		= 0		; 0x01 - CADIC Data Read Out Busy

; ----------	Register ADCRA bits		------------------------
.equ	ADPSEL		= 3		; 0x08 - ADC Polarity Select
.equ	ADCMS_MASK	= 0x06		;      - C-ADC Chopper Mode Select (2 bits)
.equ	ADCMS0		= 1		;          ADCMS BIT0 position
.equ	CKSEL		= 0		; 0x01 - Sampling Clock Select
; ::::  ADCMS	:::: bitfield values
;			0x00		; Chopping Disabled
;			0x02		; Automatic Fast Chopping
;			0x04		; Automatic Slow Chopping
;			0x06		; Software Polarity Control
; ::::  CKSEL	:::: bitfield values
;			0x00		; PLL (512kHz output) as sampling clock
;			0x01		; Slow RC Oscillator as sampling clock

; ----------	Register ADCRB bits		------------------------
.equ	ADIDES_MASK	= 0x18		;      - Instantaneous Decimation Ratio Select (2 bits)
.equ	ADIDES0		= 3		;          ADIDES BIT0 position
.equ	ADADES_MASK	= 0x07		;      - Accumulated Decimation Ratio Select (3 bits)
.equ	ADADES0		= 0		;          ADADES BIT0 position
; ::::  ADIDES	:::: bitfield values
;			0x00		; 512
;			0x08		; 256
;			0x10		; 128
;			0x18		; 64
; ::::  ADADES	:::: bitfield values
;			0x00		; 512
;			0x01		; 256
;			0x02		; 128
;			0x03		; 64
;			0x04		; 32
;			0x05		; 16
;			0x06		; 8
;			0x07		; 4

; ----------	Register ADCRC bits		------------------------
.equ	CADEN		= 7		; 0x80 - C-ADC Enable
.equ	CADRCM_MASK	= 0x30		;      - C-ADC Regular Current Comparator Mode (2 bits)
.equ	CADRCM0		= 4		;          CADRCM BIT0 position
.equ	CADRCT_MASK	= 0x0F		;      - C-ADC Regular Current Count Threshold (4 bits)
.equ	CADRCT0		= 0		;          CADRCT BIT0 position
; ::::  CADRCM	:::: bitfield values
;			0x00		; Comparator Disabled
;			0x10		; Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and is reset if Accumulated Current is below threshold.
;			0x20		; Comparator Enabled. Regular Current Counter counts up if Accumulated Current is above threshold and down if Accumulated Current is below threshold.
;			0x30		; Reserved
; ::::  CADRCT	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 3
;			0x03		; 4
;			0x04		; 5
;			0x05		; 6
;			0x06		; 7
;			0x07		; 8
;			0x08		; 9
;			0x09		; 10
;			0x0A		; 11
;			0x0B		; 12
;			0x0C		; 13
;			0x0D		; 14
;			0x0E		; 15
;			0x0F		; 16

