sterentev/atdf-device-asm-include/inc/ATmega64HVE2.inc
; ----------	Register ADCRD bits		------------------------
.equ	CADG_MASK	= 0x38		;      - C-ADC Gain (3 bits)
.equ	CADG0		= 3		;          CADG BIT0 position
.equ	CADPDM_MASK	= 0x06		;      - C-ADC Pin Diagnostics Mode (2 bits)
.equ	CADPDM0		= 1		;          CADPDM BIT0 position
.equ	CADDSEL		= 0		; 0x01 - C-ADC Diagnostics Channel Select
; ::::  CADG	:::: bitfield values
;			0x00		; 4x
;			0x08		; 8x
;			0x10		; 16x
;			0x18		; 32x
;			0x20		; 64x
;			0x28		; 128x
;			0x30		; 256x
;			0x38		; Reserved
; ::::  CADPDM	:::: bitfield values
;			0x00		; No current source is enabled
;			0x02		; Current source on PI pin enabled
;			0x04		; Current source on NI pin enabled
;			0x06		; Current source on both PI/NI pins enabled

; ----------	Register ADCRE bits		------------------------
.equ	VADEN		= 7		; 0x80 - V-ADC Enable
.equ	VADREFS		= 5		; 0x20 - V-ADC Reference Select
.equ	VADPDM_MASK	= 0x18		;      - V-ADC Pin Diagnostics Mode (2 bits)
.equ	VADPDM0		= 3		;          VADPDM BIT0 position
.equ	VADMUX_MASK	= 0x07		;      - V-ADC Channel Select (3 bits)
.equ	VADMUX0		= 0		;          VADMUX BIT0 position
; ::::  VADREFS	:::: bitfield values
;			0x00		; VREF as reference
;			0x20		; AVDD/3 as reference (for diagnosis purpose)
; ::::  VADPDM	:::: bitfield values
;			0x00		; No current source is enabled
;			0x08		; Current source on PV pin enabled
;			0x10		; Current source on NV pin enabled
;			0x18		; Current source on both PV/NV pins enabled
; ::::  VADMUX	:::: bitfield values
;			0x00		; PV - NV
;			0x01		; ADC0 - SGND
;			0x02		; ADC1 - SGND
;			0x03		; VTEMP - GND
;			0x04		; DIAGNOSIS - GND (VREF/TBD)
;			0x05		; Reserved
;			0x06		; Reserved
;			0x07		; Reserved

; ----------	Register ADIFR bits		------------------------
.equ	VADACIF		= 5		; 0x20 - V-ADC Accumulated Voltage Interrupt Flag
.equ	VADICIF		= 4		; 0x10 - V-DAC Instantaneous Voltage Interrupt Flag
.equ	CADRCIF		= 2		; 0x04 - C-ADC Regulator Current Interrupt Flag
.equ	CADACIF		= 1		; 0x02 - C-ADC Accumulated Current Interrupt Flag
.equ	CADICIF		= 0		; 0x01 - C-ADC Instantaneous Current Interrupt Flag

; ----------	Register ADIMR bits		------------------------
.equ	VADACIE		= 5		; 0x20 - V-ADC Accumulated Voltage Interrupt Enable
.equ	VADICIE		= 4		; 0x10 - V-DAC Instantaneous Voltage Interrupt Enable
.equ	CADRCIE		= 2		; 0x04 - C-ADC Regulator Current Interrupt Enable
.equ	CADACIE		= 1		; 0x02 - C-ADC Accumulated Current Interrupt Enable
.equ	CADICIE		= 0		; 0x01 - C-ADC Instantaneous Current Interrupt Enable



; ====	BANDGAP MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register BGCSRA bits		------------------------
.equ	BGSC_MASK	= 0x07		;      - Band Gap Sample Configuration (3 bits)
.equ	BGSC0		= 0		;          BGSC BIT0 position

; ----------	Register BGCRA bits		------------------------
.equ	BGCN_MASK	= 0xFF		;      - Band Gap Calibration Nominal (8 bits)
.equ	BGCN0		= 0		;          BGCN BIT0 position

; ----------	Register BGCRB bits		------------------------
.equ	BGCL_MASK	= 0xFF		;      - Band Gap Calibration Linear (8 bits)
.equ	BGCL0		= 0		;          BGCL BIT0 position

; ----------	Register BGLR bits		------------------------
.equ	BGPLE		= 1		; 0x02 - Band Gap Lock Enable
.equ	BGPL		= 0		; 0x01 - Band Gap Lock



; ====	LINUART MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LINCR bits		------------------------
.equ	LSWRES		= 7		; 0x80 - Software Reset
.equ	LIN13		= 6		; 0x40 - LIN Standard
.equ	LCONF_MASK	= 0x30		;      - LIN Configuration bits (2 bits)
.equ	LCONF0		= 4		;          LCONF BIT0 position
.equ	LENA		= 3		; 0x08 - LIN or UART Enable
.equ	LCMD_MASK	= 0x07		;      - LIN Command and Mode bits (3 bits)
.equ	LCMD0		= 0		;          LCMD BIT0 position

; ----------	Register LINSIR bits		------------------------
.equ	LIDST_MASK	= 0xE0		;      - Identifier Status bits (3 bits)
.equ	LIDST0		= 5		;          LIDST BIT0 position
.equ	LBUSY		= 4		; 0x10 - Busy Signal
.equ	LERR		= 3		; 0x08 - Error Interrupt
.equ	LIDOK		= 2		; 0x04 - Identifier Interrupt
.equ	LTXOK		= 1		; 0x02 - Transmit Performed Interrupt
.equ	LRXOK		= 0		; 0x01 - Receive Performed Interrupt

; ----------	Register LINENIR bits		------------------------
.equ	LENERR		= 3		; 0x08 - Enable Error Interrupt
.equ	LENIDOK		= 2		; 0x04 - Enable Identifier Interrupt
.equ	LENTXOK		= 1		; 0x02 - Enable Transmit Performed Interrupt
.equ	LENRXOK		= 0		; 0x01 - Enable Receive Performed Interrupt

; ----------	Register LINERR bits		------------------------
.equ	LABORT		= 7		; 0x80 - Abort Flag
.equ	LTOERR		= 6		; 0x40 - Frame Time Out Error Flag
.equ	LOVERR		= 5		; 0x20 - Overrun Error Flag
.equ	LFERR		= 4		; 0x10 - Framing Error Flag
.equ	LSERR		= 3		; 0x08 - Synchronization Error Flag
.equ	LPERR		= 2		; 0x04 - Parity Error Flag
.equ	LCERR		= 1		; 0x02 - Checksum Error Flag
.equ	LBERR		= 0		; 0x01 - Bit Error Flag

; ----------	Register LINBTR bits		------------------------
.equ	LDISR		= 7		; 0x80 - Disable Bit Timing Resynchronization
.equ	LBT_MASK	= 0x3F		;      - LIN Bit Timing bits (6 bits)
.equ	LBT0		= 0		;          LBT BIT0 position

; ----------	Register LINBRRL bits		------------------------
.equ	LINBRRL_LDIV_MASK= 0xFF		;      -  (8 bits)
.equ	LINBRRL_LDIV0	= 0		;          LINBRRL_LDIV BIT0 position

; ----------	Register LINBRRH bits		------------------------
.equ	LINBRRH_LDIV_MASK= 0x0F		;      -  (4 bits)
.equ	LINBRRH_LDIV0	= 0		;          LINBRRH_LDIV BIT0 position

; ----------	Register LINDLR bits		------------------------
.equ	LTXDL_MASK	= 0xF0		;      - LIN Transmit Data Length bits (4 bits)
.equ	LTXDL0		= 4		;          LTXDL BIT0 position
.equ	LRXDL_MASK	= 0x0F		;      - LIN Receive Data Length bits (4 bits)
.equ	LRXDL0		= 0		;          LRXDL BIT0 position

; ----------	Register LINIDR bits		------------------------
.equ	LP_MASK		= 0xC0		;      - Parity bits (2 bits)
.equ	LP0		= 6		;          LP BIT0 position
.equ	LID_MASK	= 0x3F		;      - Identifier bit 5 or Data Length bits (6 bits)
.equ	LID0		= 0		;          LID BIT0 position

; ----------	Register LINSEL bits		------------------------
.equ	LAINC		= 3		; 0x08 - Auto Increment of Data Buffer Index (Active Low)
.equ	LINDX_MASK	= 0x07		;      - FIFO LIN Data Buffer Index bits (3 bits)
.equ	LINDX0		= 0		;          LINDX BIT0 position

; ----------	Register LINDAT bits		------------------------
.equ	LDATA_MASK	= 0xFF		;      -  (8 bits)
.equ	LDATA0		= 0		;          LDATA BIT0 position



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	CKOE		= 5		; 0x20 - Clock Output Enable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

