sterentev/atdf-device-asm-include/inc/ATmega64HVE2.inc
; ----------	Register MCUSR bits		------------------------
.equ	OCDRF		= 4		; 0x10 - OCD Reset Flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BODRF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register PLLCSR bits		------------------------
.equ	SWEN		= 5		; 0x20 - PLL Software Enable
.equ	LOCK		= 4		; 0x10 - PLL Lock
.equ	PLLCIF		= 1		; 0x02 - PLL Lock Change Interrupt Flag
.equ	PLLCIE		= 0		; 0x01 - PLL Lock Change Interrupt Enable

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Extended Standby

; ----------	Register DIDR0 bits		------------------------
.equ	PA1DID		= 1		; 0x02 - When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled.
.equ	PA0DID		= 0		; 0x01 - When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled.

; ----------	Register PRR0 bits		------------------------
.equ	PRLIN		= 3		; 0x08 - Power Reduction LIN UART Interface
.equ	PRSPI		= 2		; 0x04 - Power reduction SPI
.equ	PRTIM1		= 1		; 0x02 - Power Reduction Timer/Counter1
.equ	PRTIM0		= 0		; 0x01 - Power Reduction Timer/Counter0

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - Clock Prescaler Change Enable
.equ	CLKPS_MASK	= 0x03		;      - Clock Prescaler Select Bits (2 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC01		= 1		; 0x02 - External Interrupt Sense Control 0 Bit 1
.equ	ISC00		= 0		; 0x01 - External Interrupt Sense Control 0 Bit 0
; ::::  ISC00	>>>> This is a part of INTERRUPT_SENSE_CONTROL enum (see complete values list below)

; ----------	Register EIMSK bits		------------------------
.equ	INT0		= 0		; 0x01 - External Interrupt Request 0 Enable

; ----------	Register EIFR bits		------------------------
.equ	INTF0		= 0		; 0x01 - External Interrupt Flag 0

; ----------	Register PCICR bits		------------------------
.equ	PCIE_MASK	= 0x03		;      - Pin Change Interrupt Enables (2 bits)
.equ	PCIE0		= 0		;          PCIE BIT0 position

; ----------	Register PCIFR bits		------------------------
.equ	PCIF_MASK	= 0x03		;      - Pin Change Interrupt Flags (2 bits)
.equ	PCIF0		= 0		;          PCIF BIT0 position



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K

; ----------	Register WDTCLR bits		------------------------
.equ	WDCL_MASK	= 0x06		;      - Watchdog Timer Configuration Lock bits (2 bits)
.equ	WDCL0		= 1		;          WDCL BIT0 position
.equ	WDCLE		= 0		; 0x01 - Watchdog Timer Configuration Lock Enable



; ====	WAKEUP_TIMER MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register WUTCSR bits		------------------------
.equ	WUTIF		= 7		; 0x80 - Wake-up Timer Interrupt Flag
.equ	WUTIE		= 6		; 0x40 - Wake-up Timer Interrupt Enable
.equ	WUTR		= 4		; 0x10 - Wake-up Timer Reset
.equ	WUTE		= 3		; 0x08 - Wake-up Timer Enable
.equ	WUTP_MASK	= 0x07		;      - Wake-up Timer Prescaler Bits (3 bits)
.equ	WUTP0		= 0		;          WUTP BIT0 position




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64
; ::::  CLK_SEL_3BIT_EXT	:::: values
;			0b000		; No Clock Source (Stopped)
;			0b001		; Running, No Prescaling
;			0b010		; Running, CLK/8
;			0b011		; Running, CLK/64
;			0b100		; Running, CLK/256
;			0b101		; Running, CLK/1024
;			0b110		; Running, ExtClk Tn Falling Edge
;			0b111		; Running, ExtClk Tn Rising Edge
; ::::  INTERRUPT_SENSE_CONTROL	:::: values
;			0b00		; Low Level of INTX
;			0b01		; Any Logical Change of INTX
;			0b10		; Falling Edge of INTX
;			0b11		; Rising Edge of INTX



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 25
.equ	INT_VECTORS_SIZE	= 0x32
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	INT0		; External Interrupt 0
;	2	PCINT0		; Pin Change Interrupt 0
;	3	PCINT1		; Pin Change Interrupt 1
;	4	WDT		; Watchdog Timeout Interrupt
;	5	WAKEUP		; Wakeup Timer Overflow
;	6	TIMER1_IC	; Timer 1 Input capture
;	7	TIMER1_COMPA	; Timer 1 Compare Match A
;	8	TIMER1_COMPB	; Timer 1 Compare Match B
;	9	TIMER1_OVF	; Timer 1 overflow
;	10	TIMER0_IC	; Timer 0 Input Capture
;	11	TIMER0_COMPA	; Timer 0 Compare Match A
;	12	TIMER0_COMPB	; Timer 0 Compare Match B
;	13	TIMER0_OVF	; Timer 0 Overflow
;	14	LIN_STATUS	; LIN Status Interrupt
;	15	LIN_ERROR	; LIN Error Interrupt
;	16	SPI_STC		; SPI Serial transfer complete
;	17	VADC_CONV	; Voltage ADC Instantaneous Conversion Complete
;	18	VADC_ACC	; Voltage ADC Accumulated Conversion Complete
;	19	CADC_CONV	; C-ADC Instantaneous Conversion Complete
;	20	CADC_REG_CUR	; C-ADC Regular Current
;	21	CADC_ACC	; C-ADC Accumulated Conversion Complete
;	22	EE_READY	; EEPROM Ready
;	23	SPM		; SPM Ready
;	24	PLL		; PLL Lock Change Interrupt


