sterentev/atdf-device-asm-include/inc/ATmega64HVE2.inc
; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt 0
;#		rjmp	PCINT0_ISR	; PCINT0	 - Pin Change Interrupt 0
;#		reti			; PCINT1	 - Pin Change Interrupt 1
;#		reti			; WDT		 - Watchdog Timeout Interrupt
;#		reti			; WAKEUP	 - Wakeup Timer Overflow
;#		reti			; TIMER1_IC	 - Timer 1 Input capture
;#		reti			; TIMER1_COMPA	 - Timer 1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer 1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer 1 overflow
;#		reti			; TIMER0_IC	 - Timer 0 Input Capture
;#		reti			; TIMER0_COMPA	 - Timer 0 Compare Match A
;#		reti			; TIMER0_COMPB	 - Timer 0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer 0 Overflow
;#		reti			; LIN_STATUS	 - LIN Status Interrupt
;#		reti			; LIN_ERROR	 - LIN Error Interrupt
;#		reti			; SPI_STC	 - SPI Serial transfer complete
;#		reti			; VADC_CONV	 - Voltage ADC Instantaneous Conversion Complete
;#		reti			; VADC_ACC	 - Voltage ADC Accumulated Conversion Complete
;#		reti			; CADC_CONV	 - C-ADC Instantaneous Conversion Complete
;#		reti			; CADC_REG_CUR	 - C-ADC Regular Current
;#		reti			; CADC_ACC	 - C-ADC Accumulated Conversion Complete
;#		rjmp	EE_READY_ISR	; EE_READY	 - EEPROM Ready
;#		reti			; SPM		 - SPM Ready
;#		reti			; PLL		 - PLL Lock Change Interrupt
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA64HVE2_INC_ */

; ************************ END OF FILE *********************************

